#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_ecr_repository.tune-train: Refreshing state... [id=tune-train-repo-prod]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0f5e85a6837c2abb4]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-004ba7a9c0571c326]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-054f618b8fe51c0b3]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0b662b085bc6fd917]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-03215414feb73c1e1]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-08c854a881c7e4b96]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0f234e487eb264c56]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-078186ce140174445]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0b12d94f6d8a0065d]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0635f83caa68c9c1c]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-09ee3204b089ff7bf]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0b662b085bc6fd9171080289494]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0e722886e7dfe752e]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0875396fd07d485ca]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-091a3733528e115b2]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0688dc5ab34b20fa9]
aws_db_subnet_group.tune-train-db-subnet-group: Refreshing state... [id=tune-train-db-subnet-group]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-06a1a9a13a90c44c9]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0224e2171b33a1ee7]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0b12d94f6d8a0065d1080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0635f83caa68c9c1c1080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_db_instance.tune-train will be created
  + resource "aws_db_instance" "tune-train" {
      + address                               = (known after apply)
      + allocated_storage                     = 5
      + allow_major_version_upgrade           = false
      + apply_immediately                     = (known after apply)
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = "us-east-2a"
      + backup_retention_period               = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = (sensitive)
      + db_subnet_group_name                  = "tune-train-db-subnet-group"
      + delete_automated_backups              = true
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_version                        = "14.4"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "tune-train-prod"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t4g.micro"
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + maintenance_window                    = (known after apply)
      + max_allocated_storage                 = 20
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + name                                  = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = true
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = 7
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_type                          = (known after apply)
      + tags                                  = {
          + "managedBy" = "terraform"
          + "service"   = "tune-train"
          + "stage"     = "prod"
        }
      + tags_all                              = {
          + "managedBy" = "terraform"
          + "service"   = "tune-train"
          + "stage"     = "prod"
        }
      + timezone                              = (known after apply)
      + username                              = (sensitive)
      + vpc_security_group_ids                = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @ericvtheg, Action: `pull_request`, Working Directory: ``, Workflow: `Deploy Infrastructure`*